anacristinadavila/Proyectos-finales/Proyecto2_semaforo_Proyecto2_semaforo/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t O_Sensor_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA1 (pin 27)  */
    GPIO_PinInit(BOARD_INITPINS_O_Sensor_GPIO, BOARD_INITPINS_O_Sensor_PIN, &O_Sensor_config);

    gpio_pin_config_t O_Vuelta_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA2 (pin 28)  */
    GPIO_PinInit(BOARD_INITPINS_O_Vuelta_GPIO, BOARD_INITPINS_O_Vuelta_PIN, &O_Vuelta_config);

    gpio_pin_config_t O_Verde_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA4 (pin 30)  */
    GPIO_PinInit(BOARD_INITPINS_O_Verde_GPIO, BOARD_INITPINS_O_Verde_PIN, &O_Verde_config);

    gpio_pin_config_t O_Amarillo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA12 (pin 32)  */
    GPIO_PinInit(BOARD_INITPINS_O_Amarillo_GPIO, BOARD_INITPINS_O_Amarillo_PIN, &O_Amarillo_config);

    gpio_pin_config_t N_Verde_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_N_Verde_GPIO, BOARD_INITPINS_N_Verde_PIN, &N_Verde_config);

    gpio_pin_config_t N_Amarillo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_N_Amarillo_GPIO, BOARD_INITPINS_N_Amarillo_PIN, &N_Amarillo_config);

    gpio_pin_config_t N_Rojo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_N_Rojo_GPIO, BOARD_INITPINS_N_Rojo_PIN, &N_Rojo_config);

    gpio_pin_config_t N_Vuelta_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_N_Vuelta_GPIO, BOARD_INITPINS_N_Vuelta_PIN, &N_Vuelta_config);

    gpio_pin_config_t E_Vuelta_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_E_Vuelta_GPIO, BOARD_INITPINS_E_Vuelta_PIN, &E_Vuelta_config);

    gpio_pin_config_t N_Sensor_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_N_Sensor_GPIO, BOARD_INITPINS_N_Sensor_PIN, &N_Sensor_config);

    gpio_pin_config_t E_Rojo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_E_Rojo_GPIO, BOARD_INITPINS_E_Rojo_PIN, &E_Rojo_config);

    gpio_pin_config_t E_Amarillo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 61)  */
    GPIO_PinInit(BOARD_INITPINS_E_Amarillo_GPIO, BOARD_INITPINS_E_Amarillo_PIN, &E_Amarillo_config);

    gpio_pin_config_t E_Verde_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_E_Verde_GPIO, BOARD_INITPINS_E_Verde_PIN, &E_Verde_config);

    gpio_pin_config_t E_Sensor_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_E_Sensor_GPIO, BOARD_INITPINS_E_Sensor_PIN, &E_Sensor_config);

    gpio_pin_config_t O_Rojo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 77)  */
    GPIO_PinInit(BOARD_INITPINS_O_Rojo_GPIO, BOARD_INITPINS_O_Rojo_PIN, &O_Rojo_config);

    gpio_pin_config_t S_Verde_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE20 (pin 13)  */
    GPIO_PinInit(BOARD_INITPINS_S_Verde_GPIO, BOARD_INITPINS_S_Verde_PIN, &S_Verde_config);

    gpio_pin_config_t S_Amarillo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE21 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_S_Amarillo_GPIO, BOARD_INITPINS_S_Amarillo_PIN, &S_Amarillo_config);

    gpio_pin_config_t S_Rojo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE22 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_S_Rojo_GPIO, BOARD_INITPINS_S_Rojo_PIN, &S_Rojo_config);

    gpio_pin_config_t S_Vuelta_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE23 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_S_Vuelta_GPIO, BOARD_INITPINS_S_Vuelta_PIN, &S_Vuelta_config);

    gpio_pin_config_t S_Sensor_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE29 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_S_Sensor_GPIO, BOARD_INITPINS_S_Sensor_PIN, &S_Sensor_config);

