anacristinadavila/Proyectos-finales/Proyecto2_semaforo_Proyecto2_semaforo/board/pin_mux.c
    const port_pin_config_t O_Sensor = {/* Internal pull-up resistor is enabled */
                                        kPORT_PullUp,
                                        /* Slow slew rate is configured */
                                        kPORT_SlowSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as PTA1 */
                                        kPORT_MuxAsGpio};
    /* PORTA1 (pin 27) is configured as PTA1 */
    PORT_SetPinConfig(BOARD_INITPINS_O_Sensor_PORT, BOARD_INITPINS_O_Sensor_PIN, &O_Sensor);

    /* PORTA12 (pin 32) is configured as PTA12 */
    PORT_SetPinMux(BOARD_INITPINS_O_Amarillo_PORT, BOARD_INITPINS_O_Amarillo_PIN, kPORT_MuxAsGpio);

    /* PORTA2 (pin 28) is configured as PTA2 */
    PORT_SetPinMux(BOARD_INITPINS_O_Vuelta_PORT, BOARD_INITPINS_O_Vuelta_PIN, kPORT_MuxAsGpio);

    /* PORTA4 (pin 30) is configured as PTA4 */
    PORT_SetPinMux(BOARD_INITPINS_O_Verde_PORT, BOARD_INITPINS_O_Verde_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[4] = ((PORTA->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTB0 (pin 43) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_N_Verde_PORT, BOARD_INITPINS_N_Verde_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 44) is configured as PTB1 */
    PORT_SetPinMux(BOARD_INITPINS_N_Amarillo_PORT, BOARD_INITPINS_N_Amarillo_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 45) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_N_Rojo_PORT, BOARD_INITPINS_N_Rojo_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 46) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_N_Vuelta_PORT, BOARD_INITPINS_N_Vuelta_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 55) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_E_Vuelta_PORT, BOARD_INITPINS_E_Vuelta_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t N_Sensor = {/* Internal pull-up resistor is enabled */
                                        kPORT_PullUp,
                                        /* Slow slew rate is configured */
                                        kPORT_SlowSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as PTC2 */
                                        kPORT_MuxAsGpio};
    /* PORTC2 (pin 57) is configured as PTC2 */
    PORT_SetPinConfig(BOARD_INITPINS_N_Sensor_PORT, BOARD_INITPINS_N_Sensor_PIN, &N_Sensor);

    /* PORTC3 (pin 58) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_E_Rojo_PORT, BOARD_INITPINS_E_Rojo_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 61) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_E_Amarillo_PORT, BOARD_INITPINS_E_Amarillo_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 62) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITPINS_E_Verde_PORT, BOARD_INITPINS_E_Verde_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t E_Sensor = {/* Internal pull-up resistor is enabled */
                                        kPORT_PullUp,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as PTC7 */
                                        kPORT_MuxAsGpio};
    /* PORTC7 (pin 64) is configured as PTC7 */
    PORT_SetPinConfig(BOARD_INITPINS_E_Sensor_PORT, BOARD_INITPINS_E_Sensor_PIN, &E_Sensor);

    /* PORTD4 (pin 77) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_O_Rojo_PORT, BOARD_INITPINS_O_Rojo_PIN, kPORT_MuxAsGpio);

    /* PORTE20 (pin 13) is configured as PTE20 */
    PORT_SetPinMux(BOARD_INITPINS_S_Verde_PORT, BOARD_INITPINS_S_Verde_PIN, kPORT_MuxAsGpio);

    /* PORTE21 (pin 14) is configured as PTE21 */
    PORT_SetPinMux(BOARD_INITPINS_S_Amarillo_PORT, BOARD_INITPINS_S_Amarillo_PIN, kPORT_MuxAsGpio);

    /* PORTE22 (pin 15) is configured as PTE22 */
    PORT_SetPinMux(BOARD_INITPINS_S_Rojo_PORT, BOARD_INITPINS_S_Rojo_PIN, kPORT_MuxAsGpio);

    /* PORTE23 (pin 16) is configured as PTE23 */
    PORT_SetPinMux(BOARD_INITPINS_S_Vuelta_PORT, BOARD_INITPINS_S_Vuelta_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t S_Sensor = {/* Internal pull-up resistor is enabled */
                                        kPORT_PullUp,
                                        /* Slow slew rate is configured */
                                        kPORT_SlowSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as PTE29 */
                                        kPORT_MuxAsGpio};
    /* PORTE29 (pin 21) is configured as PTE29 */
    PORT_SetPinConfig(BOARD_INITPINS_S_Sensor_PORT, BOARD_INITPINS_S_Sensor_PIN, &S_Sensor);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
